Afstkla/esp32-matter-bridge/sdkconfig.defaults
# esp32s3, 16 MB QIO flash, 8 MB OPI PSRAM at 80 MHz.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_matter_16mb.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_matter_16mb.csv"

# esp_console needs sole ownership of the USB-Serial-JTAG peripheral; a
# secondary log console on the same port corrupts REPL input.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_FREERTOS_HZ=1000

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
